
//================================================
//=
//=	敵のAI管理の処理[enemy_ai.cpp]
//= Author Sakai Minato
//=
//================================================

//=======================================
//=	インクルード
//=======================================

#include "ai_enemy.h"

#include "enemy.h"
#include "ai.h"

//=======================================
//=	コンスト定義
//=======================================

//=======================================
//=	静的変数宣言
//=======================================
// 
//=================================================
//= AIの基底クラス
//=================================================
//-------------------------------------
//-	コンストラクタ
//-------------------------------------
CAiEnemy::CAiEnemy()
{
	m_pEnemy = nullptr;
	m_pAi = nullptr;
}

//-------------------------------------
//-	デストラクタ
//-------------------------------------
CAiEnemy::~CAiEnemy()
{

}

//-------------------------------------
//- 初期化処理
//-------------------------------------
HRESULT CAiEnemy::Init(void)
{
	// 成功を返す
	return S_OK;
}

//-------------------------------------
//- 終了処理
//-------------------------------------
void CAiEnemy::Uninit(void)
{

}

//-------------------------------------
//- 敵のポインタの設定処理
//-------------------------------------
HRESULT CAiEnemy::SetEnemy(CEnemy* pEnemy)
{
	if (m_pEnemy == nullptr)
	{
		m_pEnemy = pEnemy;
	}
	else
	{
		return E_FAIL;
	}

	return S_OK;
}

//-------------------------------------
//- AIの生成処理
//-------------------------------------
void CAiEnemy::CreateAi(CAi* pAi)
{
	if (m_pAi == nullptr)
	{
		m_pAi = pAi;
	}
	else
	{
		m_pAi->Uninit();
		delete m_pAi;
		m_pAi = nullptr;

		m_pAi = pAi;
	}
}

//=================================================
//= テスト敵のAI管理のクラス
//=================================================
//-------------------------------------
//-	コンストラクタ
//-------------------------------------
CAiEnemyTest::CAiEnemyTest()
{

}

//-------------------------------------
//-	デストラクタ
//-------------------------------------
CAiEnemyTest::~CAiEnemyTest()
{

}

//-------------------------------------
//- 初期化処理
//-------------------------------------
HRESULT CAiEnemyTest::Init(CEnemy* pEnemy)
{
	// 敵のポインタを設定
	if (SetEnemy(pEnemy) == E_FAIL)
	{
		return E_FAIL;
	}

	//D3DXVECTOR3* pPos = &pEnemy->GetPos();
	//D3DXVECTOR3* pRot = &pEnemy->GetRot();

	//// AIの設定処理
	//CreateAi(CAiTgtMove::Create(pPos, pRot,D3DXVECTOR3(100.0f,0.0f,0.0f)));

	// 成功を返す
	return S_OK;
}

//-------------------------------------
//- 終了処理
//-------------------------------------
void CAiEnemyTest::Uninit(void)
{

}

//-------------------------------------
//- 更新処理
//-------------------------------------
void CAiEnemyTest::Update(void)
{
	if (GetAi() != nullptr)
	{
		// AIの更新処理
		GetAi()->Update();
	}
}

//-------------------------------------
//- 生成処理
//-------------------------------------
CAiEnemyTest* CAiEnemyTest::Create(CEnemy* pEnemy)
{
	// 生成処理
	CAiEnemyTest* pInstance = DBG_NEW CAiEnemyTest;

	if (pInstance != nullptr)
	{
		// 初期化処理
		if (FAILED(pInstance->Init(pEnemy)))
		{// 失敗時

			return nullptr;
		}
	}
	else if (pInstance == nullptr)
	{// 失敗時

		return nullptr;
	}

	// ポインタを返す
	return pInstance;
}
