
//-===============================================
//-
//-	当たり判定壁処理[box_wall.cpp]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	インクルード
//-======================================

#include "box_wall.h"

#include "renderer.h"
#include "manager.h"

//-======================================
//-	マクロ定義
//-======================================

//=======================================
//=	コンスト定義
//=======================================

//-======================================
//-	静的変数宣言
//-======================================

//-------------------------------------
//-	3D地面のコンストラクタ
//-------------------------------------
CBoxWall::CBoxWall(int nPriority) : CObject3d(nPriority)
{

}

//-------------------------------------
//-	3D地面のデストラクタ
//-------------------------------------
CBoxWall::~CBoxWall()
{

}


//-------------------------------------
//- 3D地面の初期化処理（3Dオブジェクト設定）
//-------------------------------------
HRESULT CBoxWall::Init(void)
{
	// 3Dオブジェクトの初期化
	CObject3d::Init();

	// 成功を返す
	return S_OK;
}

//-------------------------------------
//- 3D地面の終了処理
//-------------------------------------
void CBoxWall::Uninit(void)
{
	// 3Dオブジェクトの終了
	CObject3d::Uninit();
}

//-------------------------------------
//- 3D地面の更新処理
//-------------------------------------
void CBoxWall::Update(void)
{
	// 3Dオブジェクトの更新処理
	CObject3d::Update();
}

//-------------------------------------
//- 3D地面の描画処理
//-------------------------------------
void CBoxWall::Draw(void)
{
	// 3Dオブジェクトの描画処理
	CObject3d::Draw();
}

//-------------------------------------
//- 3D地面の生成処理
//-------------------------------------
CBoxWall* CBoxWall::Create(void)
{
	// フィールドのポインタを宣言
	CBoxWall* pCBoxWall = new CBoxWall(2);

	// 生成の成功の有無を判定
	if (pCBoxWall != NULL)
	{
		// 初期化処理
		if (FAILED(pCBoxWall->Init()))
		{// 失敗時

			// 「なし」を返す
			return NULL;
		}
	}
	else if (pCBoxWall == NULL)
	{// 失敗時

		// 「なし」を返す
		return NULL;
	}

	// フィールドのポインタを返す
	return pCBoxWall;
}