
//-===============================================
//-
//-	敵ファイル処理のヘッダー[map_enemy.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _MAP_ENEMY_H_		// このマクロが定義されなかったら
#define _MAP_ENEMY_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

//-======================================
//-	マクロ定義
//-======================================

//-======================================
//-	前方宣言
//-======================================

//-======================================
//-	クラス定義
//-======================================

class CMapEnemy
{

public:

	typedef enum
	{
		TXT_NORMAL_000 = 0,	// 通常敵_000のテキスト
	}TXT;

	CMapEnemy();
	~CMapEnemy();

	static void Save(CMapEnemy::TXT txtType);
	static void Load(CMapEnemy::TXT txtType);

private:

};

#endif	// 二重インクルード防止の終了
