
//-===============================================
//-
//-	ランキングの処理のヘッダー[ranking.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _RANKING_H_		// このマクロが定義されなかったら
#define _RANKING_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

#include "manager.h"

//=======================================
//=	マクロ定義
//=======================================

//-======================================
//-	前方宣言
//-======================================

class CCharacter;
class CRank;

//-======================================
//-	クラス定義
//-======================================

class CRanking : public CScene
{

public:

	CRanking();
	~CRanking();

	HRESULT Init(HINSTANCE hInstance, HWND hWnd, BOOL bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:

	static CRank* m_pRank;				// ランク
	static CCharacter* m_pCharacter;	// キャラクター

};

#endif	// 二重インクルード防止の終了
