
//-===============================================
//-
//-	テストの処理のヘッダー[test.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _TEST_H_		// このマクロが定義されなかったら
#define _TEST_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

#include "enemy.h"

#include "ai_enemy.h"

//=======================================
//=	コンスト定義
//=======================================

//=======================================
//=	前方宣言
//=======================================

class CCharacter;

//-======================================
//-	クラス定義
//-======================================

class CTest : public CEnemy
{

public:

	CTest();
	~CTest();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTest* Create(void);

private:

	CCharacter* m_pCharacter;		// キャラクターのポインタ
	CAiEnemy* m_pAiEnemy;			// 敵のAI管理のポインタ

};

#endif	// 二重インクルード防止の終了
